src/Catalogs/ОграниченияДоступаККонтурамАдминистрирования/ОграниченияДоступаККонтурамАдминистрирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОграниченияДоступаККонтурамАдминистрирования</name>
  <tabularSections>
    <name>ПользователиИБ</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеКонтуры</name>
    <attributes>
      <name>Контур</name>
      <type>
        <types>CatalogRef.КонтурыАдминистрирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ОграниченияДоступаККонтурамАдминистрирования/Forms/ФормаЭлемента/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подбор(Команда)
	Оповещение = Новый ОписаниеОповещения("ОбработатьДанныеПодбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.ОграниченияДоступаККонтурамАдминистрирования.Форма.ФормаПодбора", , ЭтотОбъект,,,,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеПодбора(Параметры, ДополнительныеПараметры) Экспорт
	Если Параметры <> Неопределено Тогда
		Для каждого Строка Из Параметры Цикл
			Если Строка.Выбран И Объект.ПользователиИБ.НайтиСтроки(Новый Структура("Имя",Строка.Имя)).Количество() = 0 Тогда
				НоваяСтрока = Объект.ПользователиИБ.Добавить();
				НоваяСтрока.Имя = Строка.Имя;
				НоваяСтрока.ПолноеИмя = Строка.ПолноеИмя;
				Модифицированность = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти
